coding-with-emacs.org
#+TITLE: Coding with Emacs
#+DATE: <2021-04-01 Thu 19:25>
这两天用 Emacs coding 的时候，本感觉我发现了一个 Emacs 在递归遍历和自动 hook 方面值得优化的地方，甚至起草好了 request 文档，反复打磨修辞。

做最后修饰和信息补充时，意外从 reddit 看到了一篇文章，里面详细描述了如何用原生方法实现我需要的功能……

在认真阅读了几遍并确认我们的理解没有偏差之后，安静地坐在电脑前面，我仿佛看到了 68 岁的 Richard Stallman 在地球的另一边，一只手捋着他的花白胡子，另一只手的大拇指轻轻点算，透过屏幕，微笑道：“年轻人，我都想到了。”

大佬贡献了极富艺术性的天才设计思想之后，端着咖啡，静静地演进和完善 GNU Emacs，供无数的追捧者使用、把玩、研究和膜拜。

#年轻人跪得再也起不来
