coding-with-emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-04-15 Thu 08:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<title>Coding with Emacs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jason Tian" />
<link rel="stylesheet" type="text/css" href="./css/worg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">Coding with Emacs</h1>
<p>
这两天用 Emacs coding 的时候，本感觉我发现了一个 Emacs 在递归遍历和自动 hook 方面值得优化的地方，甚至起草好了 request 文档，反复打磨修辞。
</p>

<p>
做最后修饰和信息补充时，意外从 reddit 看到了一篇文章，里面详细描述了如何用原生方法实现我需要的功能……
</p>

<p>
在认真阅读了几遍并确认我们的理解没有偏差之后，安静地坐在电脑前面，我仿佛看到了 68 岁的 Richard Stallman 在地球的另一边，一只手捋着他的花白胡子，另一只手的大拇指轻轻点算，透过屏幕，微笑道：“年轻人，我都想到了。”
</p>

<p>
大佬贡献了极富艺术性的天才设计思想之后，端着咖啡，静静地演进和完善 GNU Emacs，供无数的追捧者使用、把玩、研究和膜拜。
</p>

<p>
#年轻人跪得再也起不来
</p>
</div>
<div id="postamble" class="status">
<hr />
<p><a href="//jsntn.com">Jason Tian</a><br />2021-04-01 Thu 19:25</p>
</div>
</body>
</html>
